const enums = {
  sex: {
    'M': '男性',
    'F': '女性'
  },
  corpPropCd: {
    '0': '民办',
    '1': '公办'
  },
  genderCd: {
    '0': '女',
    '1': '男'
  },
  idTypeCd: {
    '10': '居民身份证',
    '11': '户口簿',
    '122': '中国护照-中华人民共和国因公护照',
    '121': '中国护照-中华人民共和国因私护照',
    '13': '军官证',
    '14': '军人士兵证',
    '15': '香港居民来往内地通行证',
    '16': '台湾居民来往大陆通行证',
    '17': '临时身份证',
    '18': '外国人永久居留证',
    '19': '警官证',
    '1X': '其他证件',
    '1a': '武警士兵证',
    '1b': '军人文职干部证',
    '1c': '武警文职干部证',
    '1d': '驾驶证',
    '1e': '军人身份证',
    '1f': '武装警察身份证',
    '1g': '外国公民护照',
    '1h': '港澳居民来往内地通行证',
    '1i': '军事学员证',
    '1j': '军官退休证',
    '1k': '文职干部退休证',
    '1l': '离休干部荣誉证',
    '1m': '边民出入境通行证',
    '202': '组织机构代码证'
  },
  conStatus: {// 合同状态XD_SXCD8003
    '01':'未提交',
    '02':'审批中',
    '03': '已生效',
    '04':'已失效',
    '05': '到期失效',
    '06': '已删除',
    '07':'已冻结',
    '08':'临时失效',
    '09':'已完成',
    '10':'国结审批中'
  },
  bizTypeFlag: {// 业务性质XD_SXYW0002
    '01': '单笔业务',
    '02':'综合授信',
    '03':'统一授信',
    '04':'单笔业务',
    '05':'集团成员授信',
    '06':'集团成员授信',
    '07': '低风险业务',
    '10':'用信业务'
  },
  currencyCd: {// CD000001_BAK(eos_dict_entry)
    'MOP':'澳门元',
    'USD':'美元',
    'JPY':'日元',
    'AUD':'澳大利亚元',
    'CAD':'加拿大元',
    'CHF':'瑞士法郎元',
    'CNY':'人民币',
    'EUR':'欧元',
    'GBP':'英镑',
    'HKD':'香港元',
    'SGD':'新加坡元'
  },
  productType: {// 业务品种 tb_sys_product
    '01001001':'一般流动资金贷款', // 对公：流动资金贷款
    '01001007':'应急周转贷',
    '01001008':'文化创意贷',
    '01001009':'勿等贷',
    '01001030':'农贷宝',
    '01001010':'税贷通',
    '01001012':'批零贷',
    '01001013':'养殖通',
    '01001014':'好易融',
    '01001015':'成长贷',
    '01001016':'仓储通',
    '01001017':'品牌饲料供应',
    '01001019':'科技宝',
    '01001020':'科创多多贷',
    '01001023':'卓越贷',
    '01001024':'科创订单贷',
    '01001025':'科税贷',
    '01001026':'金苗贷',
    '01001027':'拔萃贷',
    '01001028':'快易贷',
    '01001022':'高新技术企业贷',
    '01001029':'心意贷',
    '01001031':'军民融合供e融',
    '01001011':'POS贷',
    '01001018':'重点项目建设产业链',
    '01001021':'科创精英贷',
    '01001040':'平武流动资金贷款',
    '01001041':'平武快易贷',
    '01001042':'平武养殖通',
    '01001050':'富民流动资金贷款',// 5
    '01001051':'富民利贷宝',
    '01001052':'富民农链通',
    '01001053':'富民POS贷',
    '01001054':'富民网贷通',
    '01003001':'房地产项目开发贷款',// 对公：固定资产贷款
    '01003002':'土地储备贷款',
    '01003003':'客运通',
    '01003004':'军民融合研发贷',
    '01003006':'军民融合技改贷',
    '01003005':'经营性物业抵押贷款',
    '01003007':'一般固定资产贷款',
    '01003013':'商铺贷',
    '01003015':'货运通',
    '01003011':'客户并购贷款',
    '01013010':'富民企业委托贷款',
    '01003012':'绿能贷',
    '01003016':'固易贷',
    '01003050':'富民固定资产贷款',
    '01004001':'有追索权国内保理',
    '01006001':'银行承兑汇票贴现', // 对公：票据融资
    '01006002':'商业承兑汇票贴现',
    '01006010':'富民银承贴现',  //6
    '01007001':'出口信用证押汇', // 对公：贸易融资业务
    '01007003':'出口拖收押汇',
    '01007004':'进口信用证押汇',
    '01007005':'进口T/T押汇',
    '01007006':'进口代收押汇',
    '01007010':'提货担保',
    '01007014':'国际保函',
    '01007013':'信用证开证',
    '01007009':'进口代付',
    '01007012':'福费廷',
    '01007011':'打包贷款',
    '01008002':'银承通', // 对公：银行承兑汇票
    '01008001':'银行承兑汇票',
    '01008010':'富民银行承兑汇票',//9
    '01009001':'融资性保函', // 对公：国内保函
    '01009002':'非融资性保函',
    '01009010':'富民非融资性保函',
    '010090022':'保函',
    '01013001':'单位委托贷款', // 对公：委托贷款
    '02001001':'个人创业贷款', // 个贷：经营类贷款
    '02001002':'个人经营性物业抵押贷款',
    '02001003':'扶贫开发贷',
    '02001004':'个人专项机械设备按揭贷款',
    '02001013':'快捷贷',
    '02001005':'快帮贷',
    '02001014':'链链贷',
    '02001007':'互助贷',
    '02001008':'城乡妇女创业贷',
    '02001015':'农担直通贷',
    '02001016':'下岗失业人员小额担保贷款',
    '02001040':'平武个人创业贷款',
    '02001041':'平武快捷贷',
    '02001042':'平武农担直通贷',
    '02001043':'平武互助贷',
    '02001050':'富民个人经营贷',
    '02001051':'富民小额扶贫贷',
    '02001052': '富民农机贷',
    '02001053':'富民农链通',
    '02001054':'富民POS贷',
    '02001055':'富民网吧贷',
    '02001056':'富民货运贷',
    '02001057':'富民利贷宝-经营',
    '02001058':'富民微小贷-经营',
    '02002003':'二手房按揭贷款',  // 个贷：住房类贷款
    '02002004':'个人商用房按揭贷款',
    '02002005':'个人住房按揭贷款',
    '02002006':'二手房商用房按揭贷款',
    '02002010':'富民住房按揭贷款',
    '02002011':'富民商用房按揭贷款',
    '02003001':'个人综合消费贷款',  // 个贷：消费类贷款
    '02003002':'公积金参缴职工专享消费贷款',
    '02003011':'购房客户专享消费贷款',
    '02003004':'个人代发工资账户质押消费贷款',
    '02003005':'公务员个人信用消费贷款',
    '02003006':'员工信用消费贷款',
    '02003007':'小额信用消费贷款',
    '02003008':'个人助学贷款',
    '02003009':'失地农名养老保险贷款',
    '02003012':'个人汽车消费贷款',
    '02003010':'白金贷',
    '02003013':'秒贷',
    '02003040':'平武个人综合消费贷款',
    '02003041': '平武小额信用消费贷款',
    '02003050':'富民消费贷',
    '02003051':'富民员工贷',
    '02003052':'富民园丁贷',
    '02003053':'富民利贷宝-消费',
    '02003054':'富民微小贷-消费',
    '02005001':'公积金委托贷款', // 个贷：委托贷款
    '02005002':'个人委托贷款',
    '02005010':'富民个人委托贷款'
  },
  raceCd: {
    '0': '汉',
    '1': '满',
    '2': '蒙',
    '3': '回',
    '4': '其他'
  },
  marriageCd: {
    '0': '未婚',
    '1': '已婚',
    '2': '离异'
  },
  unitCd: {
    '0': '元/小时',
    '1': '元/次',
    '2': '元/件',
    '3': '元/人',
    '4': '元/套',
    '5': '元/双',
    '6': '元/天'
  },
  state: {
    '0': '停用',
    '1': '启用',
    '9999': '已删除'
  },
  publishStatus: {
    '0': '未发布',
    '1': '已发布'
  },
  auditStatus: {
    '0': '未审核',
    '1': '已审核',
    '2': '审核不通过'
  },
  remindStatus: {
    '01': '待执行',
    '02': '已发送',
    '03': '发送失败',
    '04': '发送中'
  },
  relCd: {
    '0': '父女',
    '1': '母女',
    '2': '父子',
    '3': '母子'
  },
  isGuard: {
    '0': '是',
    '1': '否'
  },
  docTypeCd: {
    '0': '养生',
    '1': '旅游',
    '2': '新闻',
    '3': '新闻'
  },
  docPriCd: {
    '0': '高',
    '1': '中',
    '2': '低'
  },
  billstatus: {
    '0': '未复核',
    '1': '已复核',
    '2': '已审核',
    '3': '已作废'
  },
  mnpltTpcd: {
    '01': '新增',
    '02': '修改',
    '03': '删除',
    '04': '审核通过',
    '05': '审核不通过',
    '06': '反审核',
    '07': '复核通过',
    '08': '复核不通过',
    '09': '废止',
    '10': '导入'
  },
  srvTypeCd: {
    '0': '政务',
    '1': '平台',
    '2': '客服'
  },
  ifvalid: {
    '0': '否',
    '1': '是'
  },
  bookStatus: {
    '1': '可预订',
    '2': '已预订',
    '3': '已入住',
    '4': '待评价',
    '5': '已评价'
  },
  dateRepeatTypeCd: {
    '0': '每天',
    '1': '每周重复',
    '2': '间隔天数重复'
  },
  timeRepeatTypeCd: {
    '0': '固定时间',
    '1': '间隔分钟'
  },
  intervalRemindMinute: {
    '0': '每隔30分钟',
    '1': '每隔60分钟',
    '2': '每隔90分钟',
    '3': '每隔120分钟',
    '4': '每隔180分钟',
    '5': '每隔240分钟',
    '6': '每隔300分钟',
    '7': '每隔360分钟'
  },
  dosageUnit: {
    '0': 'ml',
    '1': 'mg',
    '2': '片',
    '3': '粒'
  },
  ifUsed: {
    '0': '否',
    '1': '是' },
  payStatus: {
    '0': '未支付',
    '1': '订金已支付',
    '2': '总额已支付'
  },
  orderStatus: {
    '0': '待付款',
    '1': '待实施',
    '2': '实施中',
    '3': '待付尾款',
    '4': '待评价',
    '5': '已完结',
    '6': '已取消',
    '7': '已关闭',
    '8': '申请退款',
    '9': '退款完成',
    '10': '申请更换',
    '11': '更换完成'
  }, payCd: {
    '0': '在线支付-全额',
    '1': '在线支付-订金'
  },
  ready: {
    '0': '已设计',
    '1': '默认'
  },
  status: {
    '0': '正常',
    '1': '已作废'
  },
  tplStEcd: {
    '01': '待生效',
    '02': '已生效'
  },
  searchTypeCd: {
    '01': '全文',
    '02': '标题',
    '03': '关键字',
    '04': '摘要',
    '05': '正文',
    '06': '作者名',
    '07': '知识编号'
  },
  knwldgCheckStatus: {
    '03': '创建待审核',
    '04': '修改待审核',
    '05': '删除待审核'
  },
  knwldgInactiveStatus: {
    '06': '创建退回待处理',
    '07': '修改退回待处理',
    '08': '删除退回待处理'
  }
}

export default enums

